{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"outputs": {"MobilenetV1/Predictions/Reshape": {"name": "MobilenetV1/Predictions/Reshape"}}}, "modelTopology": {"node": [{"name": "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1001"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "op": "_FusedConv2D", "input": ["input", "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_0/Relu6", "MobilenetV1/Conv2d_1_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6", "MobilenetV1/Conv2d_2_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6", "MobilenetV1/Conv2d_3_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6", "MobilenetV1/Conv2d_4_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6", "MobilenetV1/Conv2d_5_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6", "MobilenetV1/Conv2d_6_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6", "MobilenetV1/Conv2d_7_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6", "MobilenetV1/Conv2d_8_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6", "MobilenetV1/Conv2d_9_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6", "MobilenetV1/Conv2d_10_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6", "MobilenetV1/Conv2d_11_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6", "MobilenetV1/Conv2d_12_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6", "MobilenetV1/Conv2d_13_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul_1", "op": "Mul", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1", "op": "Add", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/mul_1", "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6", "op": "_FusedConv2D", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_depthwise/Relu6", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/convolution/merged_input", "MobilenetV1/MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Logits/AvgPool_1a/AvgPool", "op": "AvgPool", "input": ["MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6"], "attr": {"ksize": {"list": {"i": ["1", "7", "7", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/convolution", "op": "Conv2D", "input": ["MobilenetV1/Logits/AvgPool_1a/AvgPool", "MobilenetV1/Logits/Conv2d_1c_1x1/weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Logits/SpatialSqueeze", "op": "Squeeze", "input": ["MobilenetV1/Logits/Conv2d_1c_1x1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1", "2"]}}}}, {"name": "MobilenetV1/Predictions/Reshape", "op": "Identity", "input": ["MobilenetV1/Logits/SpatialSqueeze"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "MobilenetV1/MobilenetV1/Conv2d_0/convolution/merged_input", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_0/BatchNorm/batchnorm/sub", "shape": [8], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/mul", "shape": [8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm/sub", "shape": [8], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/convolution/merged_input", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/convolution/merged_input", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/convolution/merged_input", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/convolution/merged_input", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/convolution/merged_input", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/convolution/merged_input", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/convolution/merged_input", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/convolution/merged_input", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], 